app/views/teams/show.html.erb

SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 1]]
---

    <% @team.players.each do |player| %>