app/views/search/index.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% end %>
      <% if admin? == false && @current_user.teams.include?(player.team)  %>