app/views/competitions/new.html.erb

SELECT "teams".* FROM "teams"
---
    <%= f.label "Select a home team:"%>
    <%= f.collection_select :team1_id,  Team.all, :id, :name, :include_blank => true %>
    <%= f.label "Select a visiting team:"%>
    <%= f.collection_select :team2_id,  Team.all, :id, :name, :include_blank => true %>