app/views/players/show.html.erb


    <% if @current_user.teams.include?(@player.team) %>
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]