app/controllers/competitions_controller.rb

      def create
        @competition = Competition.create(competition_params)
        @competition.game = Game.new
        return redirect_to new_competition_path unless @competition.save
---
INSERT INTO "competitions" ("team1_id", "team2_id", "game_id", "game_week", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["team1_id", 2], ["team2_id", 3], ["game_id", 1], ["game_week", 1], ["created_at", "2020-11-30 04:27:31.270309"], ["updated_at", "2020-11-30 04:27:31.270309"]]
INSERT INTO "games" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-11-30 04:27:31.267677"], ["updated_at", "2020-11-30 04:27:31.267677"]]

    def find_competition
        @competition = Competition.find_by(id: params[:id])
---
SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]