app/controllers/games_controller.rb

      def update
        @game.update(game_params)
---
UPDATE "games" SET "winner_id" = ?, "loser_id" = ?, "team1_total_score" = ?, "team2_total_score" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["winner_id", 3], ["loser_id", 2], ["team1_total_score", 105], ["team2_total_score", 20], ["updated_at", "2020-11-30 10:14:59.818401"], ["id", 2]]

    def find_game
      @game = Game.find_by(id: params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]