app/controllers/players_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
      @team = Team.find_by(id: player_params[:team_id])