app/controllers/players_controller.rb

UPDATE "players" SET "team_id" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["team_id", 1], ["updated_at", "2020-11-30 01:09:57.688107"], ["id", 1]]
---
    def update
        @player.update(player_params)

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_player
        @player = Player.find_by(id: params[:id])