app/controllers/search_controller.rb

SELECT "players".* FROM "players"
INSERT INTO "players" ("name", "position", "nfl_team", "projected_points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dalvin Cook"], ["position", "RB"], ["nfl_team", "MIN"], ["projected_points", 393], ["created_at", "2020-11-26 09:07:08.503428"], ["updated_at", "2020-11-26 09:07:08.503428"]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "dalvin cook"], ["LIMIT", 1]]
---
  def index
    @players = Player.all
    player_name = params['player_name']
    if player_name
      @player = Player.find_or_create_from_api(player_name.to_s)