app/controllers/sessions_controller.rb

    def new
        @users = User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.find_by(id: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]