app/controllers/teams_controller.rb

  def create
    @team = Team.new(name:  create_team_params[:name])
    @team.users << User.find_by(id: create_team_params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]