app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."user_id" = ?  [["user_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"
---
    def index
       current_user
       if params[:user_id]
        @teams = User.find(params[:user_id]).teams
      else
        @teams = Team.all

INSERT INTO "teams" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teemteast"], ["user_id", 3], ["created_at", "2020-11-29 02:00:26.705852"], ["updated_at", "2020-11-29 02:00:26.705852"]]
INSERT INTO "teams" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Free Agents"], ["user_id", 7], ["created_at", "2020-11-30 01:50:15.642077"], ["updated_at", "2020-11-30 01:50:15.642077"]]
---
    def create
        @team = Team.create(team_params)
        @team.user_id = current_user.id
        return redirect_to new_team_path unless @team.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        if params[:user_id]
            @user = User.find_by(id: params[:user_id])
            @team = @User.teams.find_by(id: params[:id])

            #@team = User.find(params[:user_id]).teams.find(params[:id])
          else
            @team = Team.find(params[:id])

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_team
        @team = Team.find_by(id: params[:id])