app/controllers/users_controller.rb

    def index
      if params[:user_name]
        @users = User.find_by(username: params[:user_name])
      elsif params[:first_name]
        @users = User.find_by(first_name: params[:first_name])
      elsif params[:last_name]
        @users = User.find_by(last_name: params[:last_name])


      end

        @users = User.all
---
SELECT "users".* FROM "users"

    def create
        @user = User.create(user_params)
        @user.teams << Team.find_by(id: 1) if @user.admin
---
INSERT INTO "users" ("first_name", "last_name", "email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def find_user
        @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]