app/models/player.rb

SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "Dalvin Cook"], ["LIMIT", 1]]
---
    def self.find_by_name(name)
        Player.all.find_by(name: name.titleize)

INSERT INTO "players" ("name", "position", "nfl_team", "projected_points", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def self.create_from_api(name)
        @response = SportsData::Search.by_player(name)
        player = Player.new
        player.name = @response["Name"]
        player.nfl_team = @response["Team"]
        player.position = @response["Position"]
        player.projected_points = @response["FantasyPoints"]
        player.team_id = 1
        player.save

SELECT "players".* FROM "players" WHERE "players"."name" = ? LIMIT ?  [["name", "dalvin cook"], ["LIMIT", 1]]
---
    def self.find_or_create_from_api(name)