app/models/team.rb

    def total_team_points
        total = 0
        self.players.all.each do |player|
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = ?  [["team_id", 2]]